_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 209, 209, 64)      1792      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 209, 209, 64)      36928     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 104, 104, 64)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 104, 104, 128)     73856     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 104, 104, 128)     147584    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 52, 52, 128)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 346112)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               177209856 
_________________________________________________________________
dense_2 (Dense)              (None, 5)                 2565      
=================================================================
Total params: 177,472,581
Trainable params: 177,472,581
Non-trainable params: 0
_________________________________________________________________
